In [1]:
import pandas as pd
import numpy as np

# Series
#### One dimensional data

In [2]:
#here S is capital in Series
r=pd.Series(np.array([1,2,3,4,5,6]))
r

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int32

In [3]:
r.index

RangeIndex(start=0, stop=6, step=1)

In [4]:
r=pd.Series(np.array([1,2,3,4,5,6]),index=[1,2,3,4,5,6])
r

1    1
2    2
3    3
4    4
5    5
6    6
dtype: int32

#### index function is used to change the index and to find the index

In [5]:
r=pd.Series(np.array([1,2,3,4,5,6]),index=['a','b','c','d','e','f'])
r

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int32

In [6]:
r=pd.Series(np.array([1,2,3,4,5,6]),index=['a','b','c','d','e','f'],name='roll no')
r

a    1
b    2
c    3
d    4
e    5
f    6
Name: roll no, dtype: int32

In [7]:
r=pd.Series(np.array([1,2,3,4,5,6]),index=['a','b','c','d','e','f'],name='roll no',dtype='float')
r

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    6.0
Name: roll no, dtype: float64

In [8]:
d={'a1':99,'a2':32,'a3':67,'a4':95,'a5':78}
d.keys()

dict_keys(['a1', 'a2', 'a3', 'a4', 'a5'])

In [9]:
d.items()

dict_items([('a1', 99), ('a2', 32), ('a3', 67), ('a4', 95), ('a5', 78)])

In [10]:
d.values()

dict_values([99, 32, 67, 95, 78])

In [11]:
marks=pd.Series(d)
marks

a1    99
a2    32
a3    67
a4    95
a5    78
dtype: int64

In [12]:
marks=pd.Series(d,name='S marks')
marks

a1    99
a2    32
a3    67
a4    95
a5    78
Name: S marks, dtype: int64

In [13]:
marks=pd.Series(d,name='S marks',dtype='str')
marks

a1    99
a2    32
a3    67
a4    95
a5    78
Name: S marks, dtype: object

#### In pandas string is object

In [14]:
marks['a1']

'99'

#### To get multiple data we should use 2 sqr brackets

In [15]:
marks[['a1','a2','a3']]

a1    99
a2    32
a3    67
Name: S marks, dtype: object

In [16]:
marks['a1':'a4']

a1    99
a2    32
a3    67
a4    95
Name: S marks, dtype: object

In [20]:
#iloc - if defines index values
#loc - it defines index positions
marks.iloc[0]

'99'

In [21]:
marks.loc['a1']

'99'

In [23]:
marks.iloc[0:5]

a1    99
a2    32
a3    67
a4    95
a5    78
Name: S marks, dtype: object

In [24]:
marks.loc['a1':'a5']

a1    99
a2    32
a3    67
a4    95
a5    78
Name: S marks, dtype: object

In [26]:
import random

In [38]:
random.randint(1,10)

10

In [39]:
b=pd.Series(np.array([9,7,6,5,4,3,8]),index=list("ABCDEFG"),name='grades')
b

A    9
B    7
C    6
D    5
E    4
F    3
G    8
Name: grades, dtype: int32

In [40]:
b>6

A     True
B     True
C    False
D    False
E    False
F    False
G     True
Name: grades, dtype: bool

In [41]:
b[b>6]

A    9
B    7
G    8
Name: grades, dtype: int32

In [42]:
b*10

A    90
B    70
C    60
D    50
E    40
F    30
G    80
Name: grades, dtype: int32

In [43]:
b+10

A    19
B    17
C    16
D    15
E    14
F    13
G    18
Name: grades, dtype: int32

In [44]:
b-1

A    8
B    6
C    5
D    4
E    3
F    2
G    7
Name: grades, dtype: int32

In [45]:
b/2

A    4.5
B    3.5
C    3.0
D    2.5
E    2.0
F    1.5
G    4.0
Name: grades, dtype: float64

In [46]:
b//2

A    4
B    3
C    3
D    2
E    2
F    1
G    4
Name: grades, dtype: int32

In [47]:
b%2

A    1
B    1
C    0
D    1
E    0
F    1
G    0
Name: grades, dtype: int32

### Staistical Operators

In [48]:
b.mean()

6.0

In [49]:
b['A':'C'].mean()

7.333333333333333

### How to update the value

In [51]:
b['A']=10
b

A    10
B     7
C     6
D     5
E     4
F     3
G     8
Name: grades, dtype: int32

# Data Frames
#### probably the most imp. data structure of pandas is DataFrame. It's tabular structure tightly integrated with Series

In [53]:
ms_marks={'sub1':[99,98,93,56,76,34,23,13,15,78],
         'sub2':[67,55,65,76,45,32,21,0,99,100],
         'sub3':[12,13,14,0,9,8,10,1,4,6],
         'sub4':[99,98,97,100,95,99,94,91,99,100]}

In [55]:
marks=pd.DataFrame(ms_marks,index=['Sushma','Lakshmi','Janu','Vennela','Supraja','Vyshu','Anusha','Lasya','Vidya','Priya'])
marks

         sub1  sub2  sub3  sub4
Sushma     99    67    12    99
Lakshmi    98    55    13    98
Janu       93    65    14    97
Vennela    56    76     0   100
Supraja    76    45     9    95
Vyshu      34    32     8    99
Anusha     23    21    10    94
Lasya      13     0     1    91
Vidya      15    99     4    99
Priya      78   100     6   100

#### Here sub1 sub2.... are names
#### Sushma lakshmi...... are indexes
#### numbers are series

In [56]:
marks.loc['Sushma']

sub1    99
sub2    67
sub3    12
sub4    99
Name: Sushma, dtype: int64

In [57]:
marks.loc[['Sushma','Priya']]

        sub1  sub2  sub3  sub4
Sushma    99    67    12    99
Priya     78   100     6   100

In [58]:
marks.loc['Sushma'].sum()
# addition of all subject marks of Sushma

277

In [59]:
marks.loc[['Sushma','Priya']].sum()
# addition of both marks of sushma and Priya

sub1    177
sub2    167
sub3     18
sub4    199
dtype: int64

In [66]:
marks.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, Sushma to Priya
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sub1    10 non-null     int64
 1   sub2    10 non-null     int64
 2   sub3    10 non-null     int64
 3   sub4    10 non-null     int64
dtypes: int64(4)
memory usage: 720.0+ bytes

In [63]:
marks.size

40

In [64]:
marks.shape

(10, 4)

In [67]:
marks.describe()

            sub1        sub2       sub3        sub4
count  10.000000   10.000000  10.000000   10.000000
mean   58.500000   56.000000   7.700000   97.200000
std    34.811397   32.396845   4.877385    2.973961
min    13.000000    0.000000   0.000000   91.000000
25%    25.750000   35.250000   4.500000   95.500000
50%    66.000000   60.000000   8.500000   98.500000
75%    89.250000   73.750000  11.500000   99.000000
max    99.000000  100.000000  14.000000  100.000000

In [68]:
marks

         sub1  sub2  sub3  sub4
Sushma     99    67    12    99
Lakshmi    98    55    13    98
Janu       93    65    14    97
Vennela    56    76     0   100
Supraja    76    45     9    95
Vyshu      34    32     8    99
Anusha     23    21    10    94
Lasya      13     0     1    91
Vidya      15    99     4    99
Priya      78   100     6   100

In [70]:
marks['sub1']

Sushma     99
Lakshmi    98
Janu       93
Vennela    56
Supraja    76
Vyshu      34
Anusha     23
Lasya      13
Vidya      15
Priya      78
Name: sub1, dtype: int64

In [71]:
25/1100

0.022727272727272728

In [73]:
marks['sub1']>70

Sushma      True
Lakshmi     True
Janu        True
Vennela    False
Supraja     True
Vyshu      False
Anusha     False
Lasya      False
Vidya      False
Priya       True
Name: sub1, dtype: bool

In [75]:
marks[marks['sub1']>70]

         sub1  sub2  sub3  sub4
Sushma     99    67    12    99
Lakshmi    98    55    13    98
Janu       93    65    14    97
Supraja    76    45     9    95
Priya      78   100     6   100

In [83]:
marks[marks[['sub1','sub2','sub3','sub4']]>70]

         sub1   sub2  sub3  sub4
Sushma   99.0    NaN   NaN    99
Lakshmi  98.0    NaN   NaN    98
Janu     93.0    NaN   NaN    97
Vennela   NaN   76.0   NaN   100
Supraja  76.0    NaN   NaN    95
Vyshu     NaN    NaN   NaN    99
Anusha    NaN    NaN   NaN    94
Lasya     NaN    NaN   NaN    91
Vidya     NaN   99.0   NaN    99
Priya    78.0  100.0   NaN   100

In [82]:
marks.sub1['Vennela']

56